Repository: flyeblue/opencv401
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh

source: First row contains two elements where first one is the height of first person and second one his weight.
zh: 第一行包含两个元素，其中第一行是第一人的高度，第二行是他的体重。

source: First, as usual, let's find SIFT features in images and apply the ratio test to find the best matches.
zh: 首先，像往常一样，让我们在图像中找到SIFT特征并应用比率测试来找到最佳匹配。

source: Following method also gives the Major Axis and Minor Axis lengths.
zh: 以下方法还给出了主轴和短轴长度.

source: For BGR image, it returns an array of Blue, Green, Red values.
zh: 对于BGR图像，它返回一个蓝色，绿色，红色值的数组.

source: For better accuracy, use binary images.
zh: 为了更好的准确性，使用二进制图像.

source: For color image, you can pass [0], [1] or [2] to calculate histogram of blue, green or red channel respectively.
zh: 对于彩色图片，你可以通过 [0]， [1] ， [2] 去计算 蓝色，绿色，红色 通的直方图.

source: For descriptor matching, multi-probe LSH which improves on the traditional LSH, is used.
zh: 对于描述符匹配，使用改进传统LSH的多探测LSH。

source: For eg, brighter image will have all pixels confined to high values.
zh: 例如，较亮的图像将所有像素限制为高值。

source: For eg, we can take our t-shirt problem where you use only height of people to decide the size of t-shirt.
zh: 例如，我们可以采用我们的T恤问题，只使用人的高度来决定T恤的大小。

source: For eg, you found the contour of a straight line.
zh: 例如，您找到了直线的轮廓.

source: For example, consider below sample:
zh: 例如， 仔细思考下面的例子：

source: For example, hist = np.bincount(img.ravel(),minlength=256)
zh: 举例来说, hist = np.bincount(img.ravel(),minlength=256)

source: For example, if input is grayscale image, its value is [0].
zh: 比如，如果源图片是一个灰度图，这个值是[0]。

source: For example, in this case, we set a test data of size 50x2, which are heights and weights of 50 people.
zh: 例如，在这种情况下，我们设置大小为50x2的测试数据，其高度和权重为50人。

source: For eye detection in images, first face detection is done all over the image.
zh: 有时，您必须使用特定的图像区域。对于图像中的眼睛检测，首先在整个图像上进行人脸检测.

source: For full scale, we pass [256].
zh: 全部，则设置为 [256].

source: For grayscale image, just corresponding intensity is returned.
zh: 对于灰度图像，仅返回相应的强度。

source: For individual pixel access, the Numpy array methods, array.item() and array.itemset() are considered better, however they always return a scalar.
zh: 对于单个像素访问，Numpy数组方法，array.item()和array.itemset()被认为是更好的，但它们总是返回一个标量。

source: For more understanding, display all the intermediate images in the above code, especially img1_bg and img2_fg.
zh: 为了更加理解，请在上面的代码中显示所有中间图像，尤其是img1_bg和img2_fg。

source: For some coins, the region where they touch are segmented properly and for some, they are not.
zh: 对于某些硬币，它们触摸的区域被正确分割，而对于某些硬币则不然。

source: For that we can use morphological opening.
zh: 为此，我们可以使用形态开放.

source: For that, we can use a function from calib3d module, ie cv.findHomography().
zh: 为此，我们可以使用calib3d模块的功能， 例如 cv.findHomography().

source: For that, we can use the Otsu's binarization.
zh: 为此，我们可以使用Otsu的二值化.

source: For that, we dilate the result.
zh: 为此，我们扩大了结果。

source: For that, you need to find the histogram data first.
zh: 为此，您需要首先找到直方图数据。

source: For this sequence we got the following estimation:
zh: 对于这个序列，我们得到以下估计:

source: For this we use cv.connectedComponents().
zh: 为此，我们使用 cv.connectedComponents().

source: Forms a border around an image.
zh: 在图像周围形成边框.

source: From the figure, you can see that only when \(\lambda_1\) and \(\lambda_2\) are above a minimum value, \(\lambda_{min}\), it is conidered as a corner(green region).
zh: 从图中可以看出，只有当 \(\lambda_1\) 和\(\lambda_2\) 高于最小值\(\lambda_{min}\)时，它才会被视为一个角（绿色区域）.

source: From the histogram, you can see dark region is more than brighter region, and amount of midtones (pixel values in mid-range, say around 127) are very less.
zh: 从直方图中，您可以看到暗区域不仅仅是更亮的区域，中间色调的数量（中间区域的像素值，比如大约127）非常少。

source: Functions
zh: 函数

source: Furthermore, we estimate the camera response function (CRF) which is of great value for many computer vision algorithms.
zh: 此外，我们估计相机响应函数（CRF），这对许多计算机视觉算法具有重要价值。

source: Gaussian Blurring
zh: 高斯模糊

source: Gaussian blurring is highly effective in removing gaussian noise from the image.
zh: 高斯模糊在从图像中去除高斯噪声方面非常有效.

source: Gaussian function of space make sure only nearby pixels are considered for blurring while gaussian function of intensity difference make sure only those pixels with similar intensity to central pixel is considered for blurring.
zh: 空间的高斯函数确保仅考虑附近的像素用于模糊，而强度差的高斯函数确保仅考虑具有与中心像素相似的强度的像素用于模糊.

source: Get a basic understanding of what SVM is
zh: 基本了解SVM是什么

source: Goal
zh: 目标

source: Goals
zh: 目标

source: Gui Features in OpenCV
zh: OpenCV的GUI特性

source: HDR imaging works with images that use more than 8 bits per channel (usually 32-bit float values), allowing much wider dynamic range.
zh: HDR成像适用于每通道使用8位以上（通常为32位浮点值）的图像，从而允许更宽的动态范围.

source: HPF filters helps in finding edges in the images.
zh: HPF滤镜有助于查找图像中的边缘.

source: Here I am selecting the ball and copying it to another region in the image:
zh: 在这里，我选择球并将其复制到图像中的另一个区域:

source: Here I took two images to blend them together.
zh: 在这里，我拍了两张图片将它们混合在一起。

source: Here \(\gamma\) is taken as zero.
zh: 这里 \(\gamma\) 为0。

source: Here are the classes, structs, unions and interfaces with brief descriptions:
zh: 以下简要描述 类，数据结构，接口:

source: Here we estimate the inverse camera response function and use it for the HDR merge.
zh: 在这里，我们估计逆相机响应函数并将其用于HDR合并.

source: Here we show an alternative algorithm to merge the exposure images, where we do not need the exposure times.
zh: 在这里，我们展示了一种合并曝光图像的替代算法，我们不需要曝光时间.

source: Here we use k-means clustering for color quantization.
zh: 这里我们使用k均值聚类进行颜色量化。

source: Here we will learn to extract some frequently used properties of objects like Solidity, Equivalent Diameter, Mask image, Mean Intensity etc.
zh: 在这里，我们将学习提取一些常用的对象属性，如Solidity，Equivalent Diameter，Mask image，Mean Intensity等

source: Here you will learn different OpenCV functionalities related to Computational Photography like image denoising etc.
zh: 这这里你将学习用于图片处理的不同函数，比如图片去噪等

source: Here you will learn how to display and save images and videos, control mouse events and create trackbar.
zh: 这里你将学习如何显示、保存图片和视频，控制鼠标事件，创建trackbar。

source: Here, the function cv.medianBlur() takes median of all the pixels under kernel area and central element is replaced with this median value.
zh: 函数 cv.medianBlur() 获取内核区域下所有像素的中值，并用该中值替换中心元素.

source: Here, two methods, one using Numpy functions, next one using OpenCV function (last commented line) are given to do the same.
zh: 这里有两个方法，一个使用Numpy函数，另一个使用OpenCV函数（最后一个注释行）给出相同的方法.

source: Here, we can find the average color of an object.
zh: 在这里，我们可以找到对象的平均颜色.

source: Here, we will take both height and weight, ie two features.
zh: 在这里，我们将采用高度和重量，即两个功能。

source: High variance makes a feature more discriminative, since it responds differentially to inputs.
zh: 高差异使得特征更具辨别力，因为它对输入有不同的响应.

source: High-dynamic-range imaging (HDRI or HDR) is a technique used in imaging and photography to reproduce a greater dynamic range of luminosity than is possible with standard digital imaging or photographic techniques.
zh: 高动态范围成像（HDRI或HDR）是一种用于成像和摄影的技术，可以再现比标准数字成像或照相技术更大的动态光度范围。

source: Histogram Calculation in Numpy
zh: Numpy中的直方图计算

source: Histogram Calculation in OpenCV
zh: OpenCV中的直方图计算

source: Histograms - 1 : Find, Plot, Analyze !!!
zh: 直方图 - 1：查找，绘图，分析！！！

source: Histograms - 2: Histogram Equalization
zh: 直方图 - 2: 直方图均衡化

source: Histograms Equalization in OpenCV
zh: OpenCV的直方图均衡化

source: Histograms in OpenCV
zh: OpenCV中的直方图

source: Histograms in OpenCV.js
zh: OpenCV.js 直方图

source: Hough Line Transform
zh: 霍夫线变换

source: How to draw the contours?
zh: 如何画出轮廓?

source: I have reshaped 'z' to a column vector.
zh: 我已将'z'重新塑造为列向量。

source: I want to put OpenCV logo above an image.
zh: 我将 OpenCV logo添加到图片上。.

source: I would recommend you to read the wikipedia page on Histogram Equalization for more details about it.
zh: 我建议你阅读维基百科关于Histogram Equalization的更多信息

source: If I add two images, it will change color.
zh: 如果我添加两个图像，它将改变颜色。

source: If I blend it, I get an transparent effect.
zh: 如果我混合它，我会得到一个透明的效果。

source: If WTA_K is 3 or 4, which takes 3 or 4 points to produce BRIEF descriptor, then matching distance is defined by NORM_HAMMING2.
zh: 如果WTA_K为3或4，需要3或4个点来产生BRIEF描述符，则匹配距离由NORM_HAMMING2定义。

source: If an image is grayscale, the tuple returned contains only the number of rows and columns, so it is a good method to check whether the loaded image is grayscale or color.
zh: 如果图像是灰度图像，则返回的元组仅包含行数和列数，因此检查加载的图像是灰度还是颜色是一种很好的方法.

source: If both are given as zeros, they are calculated from kernel size.
zh: 如果两者都为零，则根据内核大小计算它们.

source: If enough matches are found, we extract the locations of matched keypoints in both the images.
zh: 如果找到足够的匹配，我们将提取两个图像中匹配关键点的位置。

source: If it is a greater than a threshold value, it is considered as a corner.
zh: 如果它大于阈值，则将其视为拐角.

source: If it was a rectangular region, I could use ROI as we did in last chapter.
zh: 如果它是一个矩形区域，我可以像上一章那样使用ROI。

source: If only sigmaX is specified, sigmaY is taken as same as sigmaX.
zh: 如果仅指定了sigmaX，则sigmaY与sigmaX相同.

source: If we pass the set of points from both the images, it will find the perpective transformation of that object.
zh: 如果我们从两个图像中传递一组点，它将找到该对象的相应变换。

source: If we plot it in \(\lambda_1 - \lambda_2\) space as we did in Harris Corner Detector, we get an image as below:
zh: 如果我们像在Harris Corner Detector中那样将它绘制在 \(\lambda_1 - \lambda_2\) 空间中，我们得到如下图像:

source: If you are familiar with a particular algorithm and can write up a tutorial including basic theory of the algorithm and code showing example usage, please do so.
zh: 如果您熟悉特定算法并且可以编写包含算法基本理论的教程和显示示例用法的代码，请执行此操作。

source: If you don't want to use normalized box filter, use cv.boxFilter().
zh: 如果您不想使用标准化的盒式过滤器, 使用 cv.boxFilter().

source: If you find any mistake in this tutorial (from a small spelling mistake to an egregious error in code or concept), feel free to correct it by cloning OpenCV in GitHub and submitting a pull request.
zh: 如果你发现本教程的任意错误（从一个小的拼写错误到代码或概念中的一个令人震惊的错误），你可以从GitHub科隆并提交拉取请求来纠正它.

source: If you pass cv.CHAIN_APPROX_NONE, all the boundary points are stored.
zh: 如果你指定 cv.CHAIN_APPROX_NONE, 存储所有边界点..

source: If you want to access all B,G,R values, you need to call array.item() separately for all.
zh: 如果要访问所有B，G，R值，则需要分别为所有通道调用array.item().

source: If you want to create a border around the image, something like a photo frame, you can use cv.copyMakeBorder().
zh: 如果你想给图片添加边框, 类似图片边框, 你可以用 cv.copyMakeBorder().

source: If you want, you can create a Gaussian kernel with the function, cv.getGaussianKernel().
zh: 如果需要，可以创建高斯内核，用 cv.getGaussianKernel().

source: Image Addition
zh: 图片加法

source: Image Blending
zh: 图片混合

source: Image Blurring (Image Smoothing)
zh: 图像模糊（图像平滑）

source: Image Denoising
zh: 图片去噪

source: Image Inpainting
zh: 图片修复

source: Image Processing
zh: 图片处理

source: Image Processing in OpenCV
zh: OpenCV的图片处理

source: Image ROI
zh: 图片 ROI

source: Image Segmentation with Watershed Algorithm
zh: 基于分水岭算法的图像分割

source: Image blurring is achieved by convolving the image with a low-pass filter kernel.
zh: 通过将图像与低通滤波器内核卷积来实现图像模糊.

source: Image datatype is obtained by `img.dtype`:
zh: 图片数据类型通过 `img.dtype`获得:

source: Image properties include number of rows, columns and channels, type of image data, number of pixels etc.
zh: 图像属性包括行数，列数和通道数，图像数据类型，像素数等.

source: Images are added as per the equation below:
zh: 图像按以下等式添加：

source: Images from Wikipedia-HDR
zh: 图片来自 Wikipedia-HDR

source: In 2005, OpenCV was used on Stanley, the vehicle that won the 2005 DARPA Grand Challenge.
zh: 2005年，OpenCV被用于Stanley，赢得 2005 DARPA Grand Challenge.

source: In OpenCV, finding contours is like finding white object from black background.
zh: 在OpenCV中，找到轮廓就像从黑色背景中找到白色物体.

source: In addition, we will need the exposure times for the regular HDR algorithms.
zh: 此外，我们还需要常规HDR算法的曝光时间.

source: In below example, we will try to find 25 best corners:
zh: 下面的代码，我们将试图找到25个最好的角落:

source: In first case, number of bins were 256 (one for each pixel) while in second case, it is only 16.
zh: 在第一种情况下，箱的数量是256（每个像素一个），而在第二种情况下，它只有16。

source: In last chapter, we saw Harris Corner Detector.
zh: 在上一章中，我们看到了Harris Corner Detector.

source: In order to save or display the results, we need to convert the data into 8-bit integers in the range of [0..255].
zh: 为了保存或显示结果，我们需要将数据转换为[0..255]范围内的8位整数。

source: In other cases, you may need to join these individual channels to a BGR image.
zh: 在其他情况下，您可能需要将这些单独的通道连接到BGR图像.

source: In previous example, we took only height for t-shirt problem.
zh: 在前面的例子中，我们只采取了T恤问题的高度。

source: In several applications, we need to extract foreground for further operations like object tracking.
zh: 在多个应用程序中，我们需要提取前景以进行对象跟踪等进一步操作.

source: In short, we found locations of some parts of an object in another cluttered image.
zh: 简而言之，我们在另一个杂乱的图像中找到了对象的某些部分的位置。

source: In some cases, we may need all the points which comprises that object.
zh: 在某些情况下，我们可能需要包含该对象的所有点.

source: In that case, for matching, NORM_HAMMING distance is used.
zh: 在这种情况下，为了匹配，使用NORM_HAMMING距离。

source: In that case, you need not use distance transform, just erosion is sufficient.
zh: 在这种情况下，您不需要使用距离变换，只需要侵蚀即可.

source: In the histogram plot, blue line shows histogram of full image while green line shows histogram of masked region.
zh: 在直方图中，蓝线显示完整图像的直方图，而绿线显示屏蔽区域的直方图。

source: In the thresholded image, we get some regions of coins which we are sure of coins and they are detached now.
zh: 在阈值图像中，我们得到了一些我们确定硬币的硬币区域，现在它们已经分离.

source: In this case, I got centers as 60 and 207.
zh: 在这种情况下，我得到了60和207的中心。

source: In this case, we collect data regarding only one thing, intensity value.
zh: 在这种情况下，我们只收集有关一件事，强度值的数据。

source: In this case, you need to split the BGR images to single channels.
zh: 在这种情况下，您需要将BGR图像分割为单个通道.

source: In this chapter,
zh: 本章节，

source: In this chapter, we will
zh: 在本章节, 我们将

source: In this demo, I added a 50% noise to our original image and applied median blur.
zh: 在这个演示中，我为原始图像添加了50％的噪点并应用了中值模糊.

source: In this section we will learn about camera calibration, stereo imaging etc.
zh: 在本节中，我们将了解相机校准，立体声成像等。

source: In this section you will learn about feature detectors and descriptors
zh: 在本节中，你将学习特征检测和描述

source: In this section you will learn basic operations on image like pixel editing, geometric transformations, code optimization, some mathematical tools etc.
zh: 在本节中， 你将学习图片的基本操作，如象素编辑、几何变换、代码优化、一些数学工具等。

source: In this section you will learn different computational photography techniques like image denoising etc.
zh: 在本节中，您将学习不同的计算摄影技术，如图像去噪等。

source: In this section you will learn different image processing functions inside OpenCV.
zh: 在本节中，你将学习OpenCV包含的不同处理图片的函数

source: In this section you will learn different techniques to work with videos like object tracking etc.
zh: 本节中，你将学习使用类似对象跟踪等分析视频的技术

source: In this section you will object detection techniques like face detection etc.
zh: 在本节中，您将对象检测技术，如人脸检测等。

source: In this section, we will see how OpenCV-Python bindings are generated
zh: 在本节中，我们将了解如何生成OpenCV-Python绑定

source: In this stage we merge the exposure sequence into one HDR image, showing 2 possibilities which we have in OpenCV.
zh: 在这个阶段，我们将曝光序列合并为一个HDR图像，显示我们在OpenCV中有两种可能性.

source: In this tutorial We will learn to setup OpenCV-Python in Ubuntu System.
zh: 在本教程中，我们将学习如何在Ubuntu系统中设置OpenCV-Python。

source: In this tutorial we show 2 algorithms (Debevec, Robertson) to generate and display HDR image from an exposure sequence, and demonstrate an alternative approach called exposure fusion (Mertens), that produces low dynamic range image and does not need the exposure times data.
zh: 在本教程中，我们展示了2种算法（Debevec，Robertson），用于生成和显示曝光序列中的HDR图像，并演示了一种称为曝光融合（Mertens）的替代方法，该方法产生低动态范围图像，不需要曝光时间数据。

source: In this tutorial we will look on the following scene, where we have 4 exposure images, with exposure times of: 15, 2.5, 1/4 and 1/30 seconds.
zh: 在本教程中，我们将查看以下场景，其中我们有4个曝光图像，曝光时间为：15,2.5,1 / 4和1/30秒。

source: In this, instead of box filter, gaussian kernel is used.
zh: 在此，使用高斯核代替箱式滤波器.

source: In those cases also, color quantization is performed.
zh: 在那些情况下，也执行颜色量化。

source: Inheritance diagram for cv::Tracker:
zh: cv::Tracker 继承关系:

source: Initialize the tracker with a known bounding box that surrounded the target.
zh: 从一个已知的包含目标的范围框初始化跟踪器.

source: Input parameters
zh: 输入参数

source: Install OpenCV-Python in Ubuntu
zh: 在 Ubuntu安装OpenCV-Python

source: Instead, we will mark unknown region, defined by unknown, with 0.
zh: 相反，我们将标记由未知定义的未知区域，为0.

source: Interesting thing is that, in the above filters, central element is a newly calculated value which may be a pixel value in the image or a new value.
zh: 有趣的是，在上面的过滤器中，中心元素是一个新计算的值，可能是图像中的像素值或新值.

source: Interfaces for high-speed GPU operations based on CUDA and OpenCL are also under active development.
zh: 基于CUDA和OpenCL的高速GPU操作接口也在积极开发中。

source: Introduction to OpenCV
zh: OpenCV序言

source: Introduction to OpenCV-Python Tutorials
zh: OpenCV-Python教程前言

source: It actually removes high frequency content (eg: noise, edges) from the image.
zh: 它实际上从图像中去除了高频内容（例如：噪声，边缘）.

source: It also use pyramid to produce multiscale-features.
zh: 它还使用金字塔来生成多尺度特征。

source: It can also be used to draw any shape provided you have its boundary points.
zh: 如果有边界点，它也可以用于绘制任何形状.

source: It can be done as follows:
zh: 它可以如下完成:

source: It can be following types:
zh: 它可以是下面的类型:

source: It can be obtained from subtracting sure_fg area from sure_bg area.
zh: 它可以从sure_bg区域中减去sure_fg区域获得.

source: It can detect the shape even if it is broken or distorted a little bit.
zh: 它可以检测到形状，即使它被破坏或扭曲一点。

source: It computes the intensity weighted centroid of the patch with located corner at center.
zh: 它计算贴片的强度加权质心，位于中心的角落。

source: It continues this operation for all the pixels in the image.
zh: 它继续对图像中的所有像素执行此操作.

source: It directly finds the histogram and plot it.
zh: 它直接找到直方图并绘制它。

source: It doesn't consider whether pixel is an edge pixel or not.
zh: 它不考虑像素是否是边缘像素.

source: It doesn't consider whether pixels have almost same intensity.
zh: 它没有考虑像素是否具有几乎相同的强度.

source: It enables the programmer to express ideas in fewer lines of code without reducing readability.
zh: 它使程序员能够用更少的代码行表达思想，而不会降低可读性。

source: It finds N strongest corners in the image by Shi-Tomasi method (or Harris Corner Detection, if you specify it).
zh: 它通过Shi-Tomasi方法（或Harris角点检测，如果你指定它）在图像中找到N个最强角.

source: It has 3 flags as below:
zh: 有以下三个flags：

source: It has a number of optional parameters.
zh: 它有许多可选参数。

source: It has a very good explanation with worked out examples, so that you would understand almost everything after reading that.
zh: 它有一个非常好的解释和解决的例子，所以你在阅读之后几乎可以理解所有内容。

source: It improves accuracy (because eyes are always on faces :D ) and performance (because we search in a small area).
zh: 它提高了准确性（因为眼睛总是在脸上：D）和表现（因为我们在一个小区域搜索）。

source: It is a plot with pixel values (ranging from 0 to 255, not always) in X-axis and corresponding number of pixels in the image on Y-axis.
zh: 它是在X轴上具有像素值（范围从0到255，并非总是）的图和在Y轴上的图像中的对应像素数。

source: It is an interactive image segmentation.
zh: 这是一种交互式图像分割.

source: It is done with the function, cv.GaussianBlur().
zh: 这个函数是 cv.GaussianBlur().

source: It is just another way of understanding the image.
zh: 这只是理解图像的另一种方式。

source: It is simpler.
zh: 它更简单.

source: It is the index of channel for which we calculate histogram.
zh: 它是我们计算直方图的通道索引。

source: It is the ratio of width to height of bounding rect of the object.
zh: 它是对象的边界矩形的宽度与高度之比.

source: It is time for final step, apply watershed.
zh: 现在是最后一步的时候，应用分水岭。

source: It is useful for removing noises.
zh: 它有助于消除噪音.

source: It labels background of the image with 0, then other objects are labelled with integers starting from 1.
zh: 它用0标记图像的背景，然后其他对象用从1开始的整数标记。

source: It needs atleast four correct points to find the transformation.
zh: 它需要至少四个正确的点来找到转换.

source: It reduces the noise effectively.
zh: 它有效地降低了噪音.

source: It removes all redundant points and compresses the contour, thereby saving memory.
zh: 它删除所有冗余点并压缩轮廓，从而节省内存.

source: It returns a tuple of number of rows, columns, and channels (if image is color):
zh: 它返回一组行，列和通道的元组（如果图像是彩色的）:

source: It simply takes the average of all the pixels under kernel area and replace the central element.
zh: 它只取内核区域下所有像素的平均值并替换中心元素.

source: It stores the (x,y) coordinates of the boundary of a shape.
zh: 它存储形状边界的（x，y）坐标.

source: It will be more useful when more than one features are present.
zh: 当存在多个特征时，它将更有用。

source: It will be more visible when you add two images.
zh: 当加两个图像时会更加明显。

source: Its first argument is source image, second argument is the contours which should be passed as a Python list, third argument is index of contours (useful when drawing individual contour.
zh: 它的第一个参数是源图像，第二个参数是应该作为Python列表传递的轮廓，第三个参数是轮廓的索引（在绘制单个轮廓时很有用）.

source: Its kernel size should be a positive odd integer.
zh: 其内核大小应为正奇数.

source: Just create a mask image with white color on the region you want to find histogram and black otherwise.
zh: 只需在要查找直方图的区域上创建一个白色的蒙版图像，否则为黑色。

source: Just draw a circle on all the coordinates in the contour array (drawn in blue color).
zh: 只需在轮廓阵列中的所有坐标上绘制一个圆圈（以蓝色绘制）.

source: LPF helps in removing noises, blurring the images etc.
zh: LPF有助于消除噪音，模糊图像等.

source: Label the region which we are sure of being the foreground or object with one color (or intensity), label the region which we are sure of being background or non-object with another color and finally the region which we are not sure of anything, label it with 0.
zh: 用一种颜色（或强度）标记我们确定为前景或对象的区域，用另一种颜色标记我们确定为背景或非对象的区域，最后标记我们不确定任何内容的区域， 用0标记它.

source: Labels will have the same size as that of test data where each data will be labelled as '0','1','2' etc. depending on their centroids.
zh: 标签将具有与测试数据相同的大小，其中每个数据将被标记为“0”，“1”，“2”等，具体取决于它们的质心。

source: Last two methods are same, but when you go forward, you will see last one is more useful.
zh: 最后两种方法是相同的，但是当你继续前进时，你会发现最后一种方法更有用.

source: Later in 1994, J. Shi and C. Tomasi made a small modification to it in their paper Good Features to Track which shows better results compared to Harris Corner Detector.
zh: 1994年晚些时候，J。Shi和C. Tomasi在他们的论文Good Features to Track 中做了一个小修改，与哈里斯角点探测器相比，显示出更好的结果.

source: Later, its active development continued under the support of Willow Garage with Gary Bradsky and Vadim Pisarevsky leading the project.
zh: 后来，它的积极发展继续在Willow Garage的支持下，Gary Bradsky和Vadim Pisarevsky领导该项目。

source: Learn about Contour Hierarchy
zh: 了解轮廓层次结构

source: Learn how to generate and display HDR image from an exposure sequence.
zh: 了解如何从曝光序列生成和显示HDR图像。

source: Learn how to merge exposure sequence and process high dynamic range images.
zh: 了解如何合并曝光顺序和处理高动态范围图像并.

source: Learn how to setup OpenCV-Python on your computer!
zh: 学习如何在你的电脑上设置OpenCV-Python！

source: Learn several arithmetic operations on images like addition, subtraction, bitwise operations etc.
zh: 学习几种图片的算术运算，如加法，减法，按位运算等

source: Learn to
zh: 学习

source: Learn to find and draw Contours
zh: 学习查找和绘制轮廓

source: Learn to find contours, draw contours etc
zh: 学习寻找轮廓，画轮廓等

source: Learn to find convexity defects, pointPolygonTest, match different shapes etc.
zh: 学习找到凸性缺陷，pointPolygonTest，匹配不同的形状等.

source: Learn to find different features of contours like area, perimeter, bounding rectangle etc.
zh: 学习找到轮廓的不同特征，如区域，周长，边界矩形等。

source: Learn to find different properties of contours like Solidity, Mean Intensity etc.
zh: 学习找到轮廓的不同属性，如Solidity，Mean Intensity等.

source: Learn to use cv.kmeans() function in OpenCV for data clustering
zh: 学习使用OpenCV 函数 cv.kmeans()进行聚类

source: Learn to:
zh: 学习

source: Left image shows the mask we created.
zh: 左图显示了我们创建的蒙版。

source: Left region of histogram shows the amount of darker pixels in image and right region shows the amount of brighter pixels.
zh: 直方图的左区域显示图像中较暗像素的数量，右区域显示较亮像素的数量。

source: Let's familiarize with the function and its parameters :
zh: 让我们熟悉一下这个函数及其参数：

source: Let's load a color image first:
zh: 首先载入彩色图片:

source: Let's see how to find contours of a binary image:
zh: 让我们看看如何找到二进制图像的轮廓:
